In [27]:
import pandas as pd
df = pd.read_excel('task1_salary.xls')
df

        Month   Base  Bonus
0     January  38400  18442
1    February  45600  16485
2       March  52800  17117
3       April  50400  27468
4         May  45600  26107
5        June  50400   2054
6        July  50400  16414
7      August  55200   1794
8   September  52800  25200
9     October  50400  23505
10   November  52800  29623
11   December  52800  28090

In [30]:
import pandas as pd
df = pd.read_excel('task1_salary.xls')

TotalYear = df['Base'].sum() + df['Bonus'].sum()
print('\n', 'Year: ', TotalYear)
TotalMonth = df.sum(axis=1)
print(TotalMonth)

 Year:  829899
0     56842
1     62085
2     69917
3     77868
4     71707
5     52454
6     66814
7     56994
8     78000
9     73905
10    82423
11    80890
dtype: int64

C:\Users\Admin\AppData\Local\Temp\ipykernel_13472\70494850.py:6: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  TotalMonth = df.sum(axis=1)